using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace SharpKnP231.Library;

public interface IPeriodic
{
    String GetPeriod(); // public abstract - за замовчуванням
}

/* Інтерфейс
 - в цілому - "зміст", зовнішній вигляд, днкларація
 - набір вимог, "контракт", виконання якого робить об`єкт
 належним до функціональних груп (наприклад USB-пристрої,
 - в ООП - абстрактний клас, в якому є лише відкриті, лише абстрактні
 лише методи (не плутати - у С# можливі порушення всіх вимог
 для сутності, що описується оператори interface)
 - "маркери" - порожні інтерфейси (без методів взагалі), які використовуються
 як "дозволи" або як належність до групи
 - на практиці - оператор мови програмування, що розрізняє різні типи
 */